attacker/data/ac+scaling+sio/spoofing/ab_results/ab_101.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        89 bytes

Concurrency Level:      10
Time taken for tests:   4.610 seconds
Complete requests:      20
Failed requests:        12
   (Connect: 0, Receive: 0, Length: 12, Exceptions: 0)
Keep-Alive requests:    19
Total transferred:      4588 bytes
HTML transferred:       1757 bytes
Requests per second:    4.34 [#/sec] (mean)
Time per request:       2305.063 [ms] (mean)
Time per request:       230.506 [ms] (mean, across all concurrent requests)
Transfer rate:          0.97 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    9   8.3     13      17
Processing:     8 1650 1112.5   2023    3855
Waiting:        0 1612 1112.8   2023    3855
Total:          8 1659 1114.0   2040    3872

Percentage of the requests served within a certain time (ms)
  50%   2040
  66%   2336
  75%   2450
  80%   2576
  90%   2945
  95%   3872
  98%   3872
  99%   3872
 100%   3872 (longest request)
