attacker/data/ac+scaling+sio/spoofing/ab_results/ab_29.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   62.499 seconds
Complete requests:      20
Failed requests:        7
   (Connect: 0, Receive: 0, Length: 7, Exceptions: 0)
Keep-Alive requests:    20
Total transferred:      4838 bytes
HTML transferred:       1858 bytes
Requests per second:    0.32 [#/sec] (mean)
Time per request:       31249.739 [ms] (mean)
Time per request:       3124.974 [ms] (mean, across all concurrent requests)
Transfer rate:          0.08 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    5   9.8      3      44
Processing:   284 7084 14974.8    654   54645
Waiting:      283 7084 14974.8    654   54644
Total:        284 7089 14975.4    661   54651

Percentage of the requests served within a certain time (ms)
  50%    661
  66%   1707
  75%   8060
  80%   8364
  90%  44744
  95%  54651
  98%  54651
  99%  54651
 100%  54651 (longest request)
