attacker/data/ac+scaling+sio/spoofing/ab_results/ab_55.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   124.164 seconds
Complete requests:      20
Failed requests:        8
   (Connect: 0, Receive: 0, Length: 8, Exceptions: 0)
Keep-Alive requests:    18
Total transferred:      4356 bytes
HTML transferred:       1674 bytes
Requests per second:    0.16 [#/sec] (mean)
Time per request:       62081.818 [ms] (mean)
Time per request:       6208.182 [ms] (mean, across all concurrent requests)
Transfer rate:          0.03 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    3   3.9      4      14
Processing:     9 13318 36524.9   1740  120077
Waiting:        9 1539 1155.1   1739    3102
Total:         12 13321 36523.9   1755  120077

Percentage of the requests served within a certain time (ms)
  50%   1755
  66%   2572
  75%   2978
  80%   3089
  90%  120058
  95%  120077
  98%  120077
  99%  120077
 100%  120077 (longest request)
