attacker/data/ac+scaling+sio/spoofing/ab_results/ab_72.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient)...Cannot open CSV output file: No such file or directory
..done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   235.060 seconds
Complete requests:      20
Failed requests:        10
   (Connect: 0, Receive: 0, Length: 10, Exceptions: 0)
Keep-Alive requests:    15
Total transferred:      3636 bytes
HTML transferred:       1401 bytes
Requests per second:    0.09 [#/sec] (mean)
Time per request:       117529.774 [ms] (mean)
Time per request:       11752.977 [ms] (mean, across all concurrent requests)
Transfer rate:          0.02 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    4   3.9      7      10
Processing:    16 36681 55353.0   2167  120312
Waiting:        0 19225 43431.4   2053  120312
Total:         16 36685 55352.1   2174  120319

Percentage of the requests served within a certain time (ms)
  50%   2174
  66%   2857
  75%  119806
  80%  120013
  90%  120064
  95%  120319
  98%  120319
  99%  120319
 100%  120319 (longest request)
