attacker/data/ac+scaling+sio/spoofing/ab_results/ab_74.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        95 bytes

Concurrency Level:      10
Time taken for tests:   93.137 seconds
Complete requests:      20
Failed requests:        19
   (Connect: 0, Receive: 0, Length: 19, Exceptions: 0)
Keep-Alive requests:    1
Total transferred:      244 bytes
HTML transferred:       95 bytes
Requests per second:    0.21 [#/sec] (mean)
Time per request:       46568.503 [ms] (mean)
Time per request:       4656.850 [ms] (mean, across all concurrent requests)
Transfer rate:          0.00 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0  122  49.7    157     205
Processing:   103 4810 20628.4    206   92450
Waiting:        0 4622 20672.2      0   92449
Total:        157 4933 20603.6    363   92467

Percentage of the requests served within a certain time (ms)
  50%    363
  66%    364
  75%    364
  80%    364
  90%    364
  95%  92467
  98%  92467
  99%  92467
 100%  92467 (longest request)
