attacker/data/ac+scaling+sio/spoofing/ab_results/ab_84.txt
This is ApacheBench, Version 2.3 <$Revision: 1903618 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 192.168.100.1 (be patient).....done


Server Software:        uvicorn
Server Hostname:        192.168.100.1
Server Port:            5000

Document Path:          /matmul
Document Length:        89 bytes

Concurrency Level:      10
Time taken for tests:   4.834 seconds
Complete requests:      20
Failed requests:        12
   (Connect: 0, Receive: 0, Length: 12, Exceptions: 0)
Keep-Alive requests:    18
Total transferred:      4344 bytes
HTML transferred:       1662 bytes
Requests per second:    4.14 [#/sec] (mean)
Time per request:       2417.130 [ms] (mean)
Time per request:       241.713 [ms] (mean, across all concurrent requests)
Transfer rate:          0.88 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   10   9.4     16      21
Processing:     8 1535 1020.7   1915    3143
Waiting:        0 1490 1069.2   1915    3143
Total:          8 1544 1022.9   1932    3148

Percentage of the requests served within a certain time (ms)
  50%   1932
  66%   2323
  75%   2405
  80%   2464
  90%   2919
  95%   3148
  98%   3148
  99%   3148
 100%   3148 (longest request)
